In [1]:
import sqlite3
import pandas as pd

In [4]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [5]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [7]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

### Все задания нужно выполнить только с помощью sql

1. Выведите количество пустых значений по колонкам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во пустых значений)

In [8]:
pd.read_sql(
    '''--sql
    /*
    условие: СТОЛБЕЦ IS NULL и СТОЛБЕЦ = '' выводят везде 0
    */
    SELECT 'CRIM' AS column_name, COUNT(CRIM) AS count_null
    FROM boston
    WHERE CRIM IS NULL
    UNION ALL
    SELECT 'ZN' AS column_name, COUNT(ZN) AS count_null
    FROM boston
    WHERE ZN IS NULL
    UNION ALL
    SELECT 'INDUS' AS column_name, COUNT(INDUS) AS count_null
    FROM boston
    WHERE INDUS IS NULL
    UNION ALL
    SELECT 'CHAS' AS column_name, COUNT(CHAS) AS count_null
    FROM boston
    WHERE CHAS IS NULL
    UNION ALL
    SELECT 'NOX' AS column_name, COUNT(NOX) AS count_null
    FROM boston
    WHERE NOX IS NULL
    ''',
    con,
)

  column_name  count_null
0        CRIM           0
1          ZN           0
2       INDUS           0
3        CHAS           0
4         NOX           0

2. Выведите количество уникальных значений по колонокам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во уникальных значений)

In [9]:
pd.read_sql(
    '''--sql
    SELECT 'CRIM' AS column_name, COUNT(DISTINCT CRIM) AS unique_val_cnt
    FROM boston
    UNION ALL
    SELECT 'ZN' AS column_name, COUNT(DISTINCT ZN) AS unique_val_cnt
    FROM boston
    UNION ALL
    SELECT 'INDUS' AS column_name, COUNT(DISTINCT INDUS) AS unique_val_cnt
    FROM boston
    UNION ALL
    SELECT 'CHAS' AS column_name, COUNT(DISTINCT CHAS) AS unique_val_cnt
    FROM boston
    UNION ALL
    SELECT 'NOX' AS column_name, COUNT(DISTINCT NOX) AS unique_val_cnt
    FROM boston
    --limit 5
    ''',
    con,
)

  column_name  unique_val_cnt
0        CRIM             504
1          ZN              26
2       INDUS              76
3        CHAS               2
4         NOX              81

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX.
Напишите какой вывод можно сделать по данным в этих колонках

In [ ]:
pd.read_sql(
    '''--sql
   -- WITH a AS (
    SELECT 'CRIM' AS column_name, PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY CRIM) AS median, MIN(CRIM) AS min_value
    FROM boston
   /* UNION ALL
    SELECT 'ZN' AS column_name, PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY ZN) AS median, MIN(ZN) AS min_value
    FROM boston
    UNION ALL
    SELECT 'INDUS' AS column_name, PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY INDUS) AS median, MIN(INDUS) AS min_value
    FROM boston
    UNION ALL
    SELECT 'CHAS' AS column_name, PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY CHAS) AS median, MIN(CHAS) AS min_value
    FROM boston
    UNION ALL
    SELECT 'NOX' AS column_name, PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY NOX) AS median, MIN(NOX) AS min_value
    FROM boston
    )
    SELECT * FROM a;*/
    ''',
    con,
)

In [34]:
# Temp space
pd.read_sql(
    '''--sql    
    SELECT 'CRIM' AS column_name
    , CRIM
    , (CRIM * 0.5) AS median
    --, MIN(CRIM) AS min_value

    FROM boston
    --WHERE CRIM * 0.5 = MIN(CRIM)
    ''',
    con,
)

    column_name     CRIM    median
0          CRIM  0.00632  0.003160
1          CRIM  0.02731  0.013655
2          CRIM  0.02729  0.013645
3          CRIM  0.03237  0.016185
4          CRIM  0.06905  0.034525
..          ...      ...       ...
501        CRIM  0.06263  0.031315
502        CRIM  0.04527  0.022635
503        CRIM  0.06076  0.030380
504        CRIM  0.10959  0.054795
505        CRIM  0.04741  0.023705

[506 rows x 3 columns]

4. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг) среди всех значений LSTAT. Напишите какой вывод можно сделать по этим данным.

In [ ]:

pd.read_sql(
    '''--sql
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

5. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [12]:

pd.read_sql(
    '''--sql
    SELECT 
    CHAS
    , AVG(MEDV * 1000) AS avg_medv
    FROM boston
    GROUP BY CHAS
    limit 5
    ''',
    con,
)

   CHAS      avg_medv
0   0.0  22093.842887
1   1.0  28440.000000

6. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX. Напишите какой вывод можно сделать по этим данным.

In [ ]:

pd.read_sql(
    '''--sql
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

7. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [ ]:

pd.read_sql(
    '''--sql
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.